RecommendRules = {
    "伴血糖升高者": {
        "强推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": []
        },
        "不推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "鱼虾": [],
            "糖类": [
                '绵白糖', '麦芽糖', '蜂蜜', '胶质软糖'
            ],
            "谷类": [
                '馒头（全麦粉）', '馒头（精制小麦粉）', '馒头（富强粉）', '烙饼', '大米饭', '黏米饭', '速冻米饭', '糯米饭',
                '玉米片',
                '小米（煮）', '米饼', '糜子饭（整粒）', '即食燕麦粥', '白面包', '全麦面包'
            ],
            "薯类": [
                '马铃薯泥', '马铃薯（烧烤、用微波炉烤）', '甘薯（红，煮）'
            ],
            "蔬菜": [
                '胡萝卜'
            ],
            "水果": [
                '西瓜', '哈密瓜'
            ]
        }
    },
    "伴血脂异常者": {
        "强推荐": {
            "蛋类": [],
            "坚果": [],
            "谷类": [
                '大米', '燕麦', '荞麦', '玉米', '高粱米', '薏米'
            ],
            "豆类": [
                '赤小豆', '绿豆', '黄豆', '黑豆'
            ],
            "薯类": [
                '甘薯'
            ],
            "蔬菜": [
                '番茄', '芹菜', '油菜', ',菠菜', '冬瓜', '白菜', '洋葱', '茄子', '韭菜', '结球甘蓝（白）', '山药',
                '白萝卜', '洋葱',
                '蒜薹', '黄瓜', '丝瓜', '扁豆', '生姜', '大蒜', '猕猴桃', '山楂'
            ],
            "水果": [
                '苹果', '桃子', '橘子类', '柠檬'
            ],
            "鱼虾": [
                '带鱼'
            ],
            "菌藻": [
                '海带', '紫菜', '黑木耳', '银耳', '香菇'
            ],
            "畜肉": [
                '瘦肉', '鸡肉', '羊肉', '鸭肉'
            ],
            "乳类": [
                '脱脂牛奶', '脱脂酸奶'
            ]
        },
        "不推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [
                '牛油果'
            ],
            "鱼虾": []
        }
    },
    "伴尿酸异常者或有痛风疾病史": {
        "强推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": [
                '白条鱼', '草鱼', '泥鳅', '鲫鱼', '鲶鱼', '鲢鱼', '武昌鱼', '黑鱼'
            ]
        },
        "不推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [
                '*'
            ],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": [
                '*'
            ]
        }
    },
    "在疾病史或手术中提到甲亢或者甲状腺的其他问题": {
        "强推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": []
        },
        "不推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [
                '*'
            ],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": [
                '*'
            ]
        }
    },
    "在疾病史或手术中提到甲减的": {
        "强推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [
                '*'
            ],
            "谷类": [],
            "坚果": [],
            "菌藻": [
                '*'
            ],
            "乳类": [
                '*'
            ],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": []
        },
        "不推荐": {
            "畜肉": [
                '五花肉'
            ],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [
                '花生', '核桃'
            ],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [
                '桃', '梨'
            ],
            "鱼虾": []
        }
    },
    "在疾病史中提到有肾功能受损的": {
        "强推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": [
                '白条鱼', '草鱼', '泥鳅', '鲫鱼', '鲶鱼', '鲢鱼', '武昌鱼', '黑鱼'
            ]
        },
        "不推荐": {
            "畜肉": [
                '羊肉（鲜）', '猪肉（瘦）'
            ],
            "蛋类": [],
            "豆类": [
                '*'
            ],
            "谷类": [
                '麦麸'
            ],
            "坚果": [
                '杏仁', '花生', '芝麻'
            ],
            "菌藻": [
                '香菇', '冬菇（干）', '蘑菇（鲜）', '黑木耳', '银耳', '紫菜', '海带'
            ],
            "乳类": [],
            "蔬菜": [
                '油菜', '马铃薯', '菠菜', '洋葱', '红苋菜', '荸荠', '黄瓜', '茄子', '生菜', '豌豆', '萝卜', '南瓜',
                '红薯', '番茄'
            ],
            "薯类": [],
            "水果": [
                '柑橘类', '香蕉', '猕猴桃', '草莓', '绿茶', '葡萄干'
            ],
            "鱼虾": [
                '*'
            ]
        }
    },
    "同型半胱氨酸升高者": {
        "强推荐": {
            "畜肉": [],
            "蛋类": [],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": []
        },
        "不推荐": {
            "畜肉": [],
            "蛋类": [
                '*'
            ],
            "豆类": [],
            "谷类": [],
            "坚果": [],
            "菌藻": [],
            "乳类": [
                '*'
            ],
            "蔬菜": [],
            "薯类": [],
            "水果": [],
            "鱼虾": []
        }
    }
}
