# 活动MET
PhysicalActivityMET = {
    'MildWorkMET': 3.3,
    'MiddleWorkMET': 4.0,
    'HeightWorkMET': 8.0,
    'MildTrafficMET': 1.5,
    'MiddleTrafficMET': 3.3,
    'HeightTrafficMET': 6.0,
    'MildHomeworkMET': 3.0,
    'MiddleHomeworkMET': 4.0,
    'HeightHomeworkMET': 5.5,
    'MildRelaxationMET': 3.3,
    'MiddleRelaxationMET': 4.0,
    'HeightRelaxationMET': 8.0
}

# 有氧运动
AerobicSportInfo = {
    "慢速步行（3km/h）": {
        "强度": "低",
        "MET": 2.5,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "中速步行（5km/h）": {
        "强度": "中",
        "MET": 3.5,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "快速步行（5.5-6km/h）": {
        "强度": "中",
        "MET": 4,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "很快速步行（7km/h）": {
        "强度": "中",
        "MET": 4.5,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "下楼梯": {
        "强度": "中",
        "MET": 3,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "上楼梯": {
        "强度": "高",
        "MET": 8,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "上下楼梯": {
        "强度": "中",
        "MET": 4.5,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "走跑结合（慢跑成分不超过10min）": {
        "强度": "中",
        "MET": 6,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484172&idx=1&sn=78d7b896cd3b201f4c98cb0f8fa0fa55&chksm=cf1e9fc2f86916d4954b1cb637085f062322209c9f1e198326782cd27d838200f78a58c03b59#rd"
    },
    "慢跑": {
        "强度": "高",
        "MET": 7,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484172&idx=1&sn=78d7b896cd3b201f4c98cb0f8fa0fa55&chksm=cf1e9fc2f86916d4954b1cb637085f062322209c9f1e198326782cd27d838200f78a58c03b59#rd"
    },
    "原地跑步": {
        "强度": "高",
        "MET": 8,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484172&idx=1&sn=78d7b896cd3b201f4c98cb0f8fa0fa55&chksm=cf1e9fc2f86916d4954b1cb637085f062322209c9f1e198326782cd27d838200f78a58c03b59#rd"
    },
    "骑自行车（12-16km/h）": {
        "强度": "中",
        "MET": 4,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "骑自行车（16-19km/h）": {
        "强度": "中",
        "MET": 6,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "跳绳": {
        "强度": "高",
        "MET": 8,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿", "手部及前臂牵拉"],
        "视频": ""
    },
    "游泳，踩水": {
        "强度": "中",
        "MET": 4,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉",
                     "背部牵拉", "站立过顶伸臂"],
        "视频": ""
    },
    "爬泳（慢），自由泳，仰泳": {
        "强度": "高",
        "MET": 8,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉",
                     "背部牵拉", "站立过顶伸臂"],
        "视频": ""
    },
    "蛙泳": {
        "强度": "极高",
        "MET": 10,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉",
                     "背部牵拉", "站立过顶伸臂"],
        "视频": ""
    },
    "爬泳（快），蝶泳": {
        "强度": "极高",
        "MET": 11,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉",
                     "背部牵拉", "站立过顶伸臂"],
        "视频": ""
    },
    "健身操": {
        "强度": "中",
        "MET": 5,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "保龄球": {
        "强度": "中",
        "MET": 3,
        "牵拉运动": ["手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉"],
        "视频": ""
    },
    "高尔夫球": {
        "强度": "中",
        "MET": 5,
        "牵拉运动": ["手部及前臂牵拉", "颈部牵拉", "肩部牵拉"],
        "视频": ""
    },
    "篮球": {
        "强度": "中",
        "MET": 6,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "排球": {
        "强度": "中",
        "MET": 3,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "乒乓球": {
        "强度": "中",
        "MET": 4,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "台球": {
        "强度": "低",
        "MET": 2.5,
        "牵拉运动": ["手部及前臂牵拉", "颈部牵拉", "肩部牵拉"],
        "视频": ""
    },
    "网球，双打": {
        "强度": "中",
        "MET": 6,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "网球，单打": {
        "强度": "中",
        "MET": 8,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "羽毛球": {
        "强度": "中",
        "MET": 4.5,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "足球": {
        "强度": "高",
        "MET": 7,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "拳击": {
        "强度": "中",
        "MET": 5.5,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "轮滑旱冰": {
        "强度": "高",
        "MET": 7,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "登山": {
        "强度": "高",
        "MET": 6.3,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "视频": ""
    },
    "钓鱼": {
        "强度": "中",
        "MET": 3.5,
        "牵拉运动": ["手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "站立过顶伸臂"],
        "视频": ""
    },
    "瑜伽": {
        "强度": "中",
        "MET": 4,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "舞蹈，慢速": {
        "强度": "中",
        "MET": 3,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "舞蹈，中速": {
        "强度": "中",
        "MET": 4.5,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "舞蹈，快速": {
        "强度": "中",
        "MET": 5.5,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": ""
    },
    "太极拳": {
        "强度": "中",
        "MET": 3.5,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484291&idx=1&sn=3a2d554dda3e956d65a4fe91246f3156&chksm=cf1e9f4df869165b3cf59cc0d65e18f0a5c47fb41ea702021e66ed9b7836de0498f413b4cb83#rd"
    },
    "气功": {
        "强度": "中",
        "MET": 3,
        "牵拉运动": ["正压腿", "侧压腿", "手部及前臂牵拉", "颈部牵拉", "肩部牵拉", "背部牵拉", "胸部牵拉", "腹部牵拉",
                     "下腰部牵拉", "小腿牵拉", "侧弓步", "坐位体前屈",
                     "站立过顶伸臂", "俯身前压腿", "股四头肌牵拉", "摆腿", "后踢腿", "转体"],
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484295&idx=1&sn=5fdaa935ff1ed7ade0dc258cadecc5b5&chksm=cf1e9f49f869165f11e90ddf174a49260fbdf79190f5331e3eeadf510034cd555d535f7b3478#rd"
    }
}

# 拉伸运动
ResistanceSportInfo = {
    "仰卧卷腹": {
        "强度": "低",
        "MET": 2.8,
        "牵拉运动": ["腹部牵拉"],
        "备注": "做2-3组，每组8-12次，组间休息2-3分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484174&idx=1&sn=a1da69ef70262ba0051e7df1d44383be&chksm=cf1e9fc0f86916d699a1b2338e6fb1c887e6a75347eb86aea9e8056ecaf17e36a8078d7ae323#rd"
    },
    "俯卧撑": {
        "强度": "中",
        "MET": 4.5,
        "牵拉运动": ["手部及前臂牵拉", "腹部牵拉"],
        "备注": "做2-3组，每组8-12次，组间休息2-3分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484176&idx=1&sn=3fd7b9b93e90778bdd31f9de99ebdad1&chksm=cf1e9fdef86916c864e61db4d11fb0a687194eea84d348369264bffa506d958a6ebd4c6a85f1#rd"
    },
    "仰卧起坐": {
        "强度": "中",
        "MET": 3.8,
        "牵拉运动": ["腹部牵拉"],
        "备注": "做2-3组，每组8-12次，组间休息2-3分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484178&idx=1&sn=c2faceaf346328ed4389c93e59040ff7&chksm=cf1e9fdcf86916ca5024a6a99193994db8c98e6a82274a40a46aba9278c00ae18f00dd1bb672#rd"
    },
    "深蹲": {
        "强度": "中",
        "MET": 5,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "备注": "做2-3组，每组8-12次，组间休息2-3分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484180&idx=1&sn=76f723fe60e50a539675069881449971&chksm=cf1e9fdaf86916cc0263fac2220555bc64dd86c2a0a90f638f1e55e3aa9fb46a9525354d9635#rd"
    },
    "弓箭步换腿跳": {
        "强度": "中",
        "MET": 3.8,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "备注": "做2-3组，每组8-12次，组间休息2-3分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484182&idx=1&sn=f4669135a6c9bb5b2f63aa1560d8c054&chksm=cf1e9fd8f86916ce81ecb1f87495f2d35212a528e5d09b5570157ff4131708e4750359c1afb0#rd"
    },
    "屈髋位卷腹": {
        "强度": "中",
        "MET": 3.8,
        "牵拉运动": ["腹部牵拉"],
        "备注": "做2-3组，每组8-12次，组间休息2-3分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484189&idx=1&sn=7640063fe7b477c5bb7a3720be58d3cb&chksm=cf1e9fd3f86916c584e3c02991bbb3fbba3723f9ceae6729c45b07dce9e76ffa467faebad63a#rd"
    },
    "引体向上": {
        "强度": "中",
        "MET": 3.8,
        "牵拉运动": ["手部及前臂牵拉", "腹部牵拉"],
        "备注": "做2-3组，每组8-12次，组间休息2-3分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484195&idx=1&sn=93d0e9aa4f5197aab7a84869c0801d45&chksm=cf1e9fedf86916fb09314d05e02c79f4e007bf64f1881d762e4e3aabe022b1a34a7753bd143f#rd"
    },
    "平板支撑": {
        "强度": "中",
        "MET": 3.3,
        "牵拉运动": ["手部及前臂牵拉", "腹部牵拉"],
        "备注": "做4组，每组持续2分钟，组间休息1-2分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484197&idx=1&sn=bfc6a9cfb2d28d73410c97a8f7979d64&chksm=cf1e9febf86916fd0e2151c119142070a68a2703ee153f09a9549e247d702d66bc48eb351cc8#rd"
    },
    "半蹲": {
        "强度": "中",
        "MET": 4,
        "牵拉运动": ["正压腿", "侧压腿", "小腿牵拉", "侧弓步", "坐位体前屈", "俯身前压腿", "股四头肌牵拉", "摆腿",
                     "后踢腿"],
        "备注": "做4组，每组持续2分钟，组间休息1-2分钟",
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484199&idx=1&sn=b732d37c9e323bd8fc7800720586f381&chksm=cf1e9fe9f86916ffe9316526c52f4413d419f318d1d13eb91b75e678c3c0a11dbeb36233e0af#rd"
    }
}

# 牵拉联系
WarmingUp = {  # 牵拉练习，强度均为低强度
    "正压腿": {
        "强度": "低",
        "MET": 2.5,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484326&idx=1&sn=9b6515e5247cf4db6a6e0551c7a9c662&chksm=cf1e9f68f869167e572c6b9c8068f32553ab058648edb643e2e1befb3a008ffc7960618bbf73#rd"
    },
    "侧压腿": {
        "强度": "低",
        "MET": 2.5,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484303&idx=1&sn=2419ccf751da2b3e20a58a097e19fc94&chksm=cf1e9f41f8691657e62c7a11200f706caf7067547f3d124eabbfdbf6eb0685fb5d917cf91ff2#rd",
    },
    "手部及前臂牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484337&idx=1&sn=5c01abe8f30381dcc2f6955f59a1abc9&chksm=cf1e9f7ff8691669d616432c628cf4dbe7cbc638154db4e6884171e2f169ffed0455fcec8a6c#rd",
    },
    "颈部牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484315&idx=1&sn=93ce6953e52faa4e34aeb1367d2aa385&chksm=cf1e9f55f8691643fa9142945daecb00bf34728f193a7718d4a8e9ba02572a6d3c99c24a8449#rd",
    },
    "肩部牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484313&idx=1&sn=73c05f46b5cd16b11e01939906548e65&chksm=cf1e9f57f8691641a0ef92ec49022e7f1b46abf5ca5ce65ec07b08b2d420f7944bce67786900#rd",
    },
    "背部牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484299&idx=1&sn=f46983b246118dee15264b9a32cbea6f&chksm=cf1e9f45f86916539e88f0432f7dde730a97da39b634b77aea940573459a68eb3f1caa863ce6#rd",
    },
    "胸部牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484322&idx=1&sn=7b793acf441405671b33115f3adab08e&chksm=cf1e9f6cf869167acc11744bc83df5f220b6a0213832ce823f8a77b61c9e6b0e4e13ed831981#rd",
    },
    "腹部牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484307&idx=1&sn=af4530c0c3b382e223c00abf1652daed&chksm=cf1e9f5df869164bb73c97eb1b338bb6c9137f8ed2fef8ee05fc22f6f0071b6e740447799b63#rd",
    },
    "下腰部牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484318&idx=1&sn=0d47b9420dac9067090b6203917f6055&chksm=cf1e9f50f86916464cc4b549531aca067d3e68d3d6aabd23208e9fc815f63f6eac2fdd85c267#rd",
    },
    "小腿牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484320&idx=1&sn=71a9c6d866d3b3f3943f9eeb75c870ca&chksm=cf1e9f6ef8691678bf1d5eea483cce1f034fd564a463c374b146cc340862b7b5d730dc0b2a70#rd",
    },
    "侧弓步": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484301&idx=1&sn=240428cb32b8425f148f09f6b90f53bf&chksm=cf1e9f43f8691655632437b50a15d0a6ab4d958cf2a31829ab046c797253f2a00d66c775df8a#rd",
    },
    "坐位体前屈": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484330&idx=1&sn=e26d41c721db710dea1bdebe888a2939&chksm=cf1e9f64f8691672227b3d8611b4dfd186e6ef309ecbb194d1a561143050abb8e08af88e7a0f#rd",
    },
    "站立过顶伸臂": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484324&idx=1&sn=e6a1c4afadebf4a600c756faa543b28b&chksm=cf1e9f6af869167c94d83996d134c0b6591f4e288c57d42d888f1c2d14bed7deb0cdfffb2de2#rd",
    },
    "俯身前压腿": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484305&idx=1&sn=bcf8a53ec18a782a7040ca858e539ee6&chksm=cf1e9f5ff8691649a894027cfe92c11d04eb449fd0262de6915fa8005adc32df0c8bffd094df#rd",
    },
    "股四头肌牵拉": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484309&idx=1&sn=60419fc11f45a30fa791e412e1cb45de&chksm=cf1e9f5bf869164dee9c14ea62f77d287bf6714dc950e2b6b5cac071346557804605809ff945#rd",
    },
    "摆腿": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484297&idx=1&sn=db2a2069f048480193a03306b4b2e8f7&chksm=cf1e9f47f86916513d327d584e5ef9a6b3ceb753439a155a0b5bcae236f8a2352b3e8865536f#rd",
    },
    "后踢腿": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484311&idx=1&sn=d12cff006412a38027a565355542244c&chksm=cf1e9f59f869164fb68427ac5d80cc1ba583b0c6dcca7435f9a4d4edf9dcb3c4ce74fa222ec4#rd",
    },
    "转体": {
        "强度": "低",
        "MET": 2.3,
        "视频": "https://mp.weixin.qq.com/s?__biz=Mzg3NzY0NTIxNw==&mid=2247484328&idx=1&sn=94a2c58e1b4023bf52dc12e1da86c295&chksm=cf1e9f66f86916704c435f60e964b5441c94c12ae9026277eed9cb22c71bd66c305d3a002f5f#rd",
    },
}

# 轻度有氧运动
MildAerobictNames = [
    "台球"
]

# 轻度拉伸运动
MildResistanceNames = [
    "仰卧卷腹"
]

# 中度有氧运动
MiddleAerobicNames = [
    "中速步行（5km/h）", "快速步行（5.5-6km/h）", "很快速步行（7km/h）", "走跑结合（慢跑成分不超过10min）",
    "骑自行车（12-16km/h）",
    "骑自行车（16-19km/h）", "游泳，踩水", "健身操", "保龄球", "高尔夫球", "篮球", "乒乓球", "网球，双打", "网球，单打",
    "羽毛球", "拳击", "钓鱼", "瑜伽",
    "舞蹈，慢速", "舞蹈，中速", "舞蹈，快速", "太极拳", "气功"
]

# 中度拉伸运动
MiddleResistanceNames = [
    "俯卧撑", "仰卧起坐", "深蹲", "弓箭步换腿跳", "屈髋位卷腹", "引体向上", "平板支撑", "半蹲"
]

# 高度有氧运动
HeightAerobicNames = [
    "上楼梯", "慢跑", "原地跑步", "跳绳", "爬泳（慢），自由泳，仰泳", "足球", "轮滑旱冰", "登山"
]

# 高度拉伸运动
HeightResistanceNames = [

]

# 握力表
GripPowerInfo = {
    "男": {
        18: 35.7,
        19: 35.7,
        20: 36.8,  # 年龄左区间: 握力
        25: 37.7,
        30: 36.0,
        35: 35.8,
        40: 35.5,
        45: 34.7,
        50: 32.9,
        55: 30.7
    },
    "女": {
        18: 19.2,
        19: 19.2,
        20: 21.5,
        25: 25.6,
        30: 21.5,
        35: 20.3,
        40: 18.9,
        45: 18.6,
        50: 18.1,
        55: 17.7
    }
}

# 个性化推荐运动
PersonalRecommendSports = {
    "51": [
        "慢速步行（3km/h）", "中速步行（5km/h）", "快速步行（5.5-6km/h）", "很快速步行（7km/h）", "下楼梯", "上楼梯",
        "上下楼梯",
    ],
    "52": [
        "走跑结合（慢跑成分不超过10min）", "慢跑", "原地跑步"
    ],
    "53": [
        "游泳，踩水", "爬泳（慢），自由泳，仰泳", "蛙泳", "爬泳（快），蝶泳"
    ],
    "54": [
        "篮球", "排球", "足球"
    ],
    "55": [
        "乒乓球", "台球", "羽毛球"
    ],
    "56": [
        "健身操", "瑜伽", "舞蹈，慢速", "舞蹈，中速", "舞蹈，快速", "太极拳", "气功"
    ],
    "57": [
        "健身操", "瑜伽", "舞蹈，慢速", "舞蹈，中速", "舞蹈，快速", "太极拳", "气功"
    ],
    "58": [
        "骑自行车（12-16km/h）", "骑自行车（16-19km/h）"
    ],
    "59": [
        "登山"
    ],
    "60": [

    ],
    "61": [

    ]
}
if __name__ == "__main__":
    for key, value in ResistanceSportInfo.items():
        if value["强度"] == "高":
            print('"' + key, end='", ')
